spec/cassettes/User_signs_in/after_verifying_their_account/shows_them_their_payment_history.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - '*'
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:42 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM11ec8fe212b511e4a82802a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBAFUVFcKAwldVlQGCAFUXR0WAVBQT0ISVFxQAQ1QVANUX1ZTAgoHXRQbQQACVEBVOQ==
      Content-Length:
      - '1289'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-23T22:02:42.938465Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-23T22:02:42.938467Z",
              "href": "/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAy4HFUqJWDxaCtUKAeUWpL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:43 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:43 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM1254c33c12b511e4aecc02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '501'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-23T22:02:42.938465Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-23T22:02:42.938467Z",
              "href": "/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAy4HFUqJWDxaCtUKAeUWpL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:43 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL/verifications
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:51 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM129c6eb212b511e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '596'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BAy4HFUqJWDxaCtUKAeUWpL"
              },
              "href": "/verifications/BZHc5vRtc8tGfcncZkWVrLq",
              "created_at": "2014-07-23T22:02:51.040423Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-23T22:02:51.357810Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZHc5vRtc8tGfcncZkWVrLq"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:51 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:52 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM17825ca212b511e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '520'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZHc5vRtc8tGfcncZkWVrLq"
              },
              "can_credit": true,
              "created_at": "2014-07-23T22:02:42.938465Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-23T22:02:42.938467Z",
              "href": "/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BAy4HFUqJWDxaCtUKAeUWpL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:52 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZHc5vRtc8tGfcncZkWVrLq
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:52 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM17b1f65612b511e4aecc02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '596'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BAy4HFUqJWDxaCtUKAeUWpL"
              },
              "href": "/verifications/BZHc5vRtc8tGfcncZkWVrLq",
              "created_at": "2014-07-23T22:02:51.040423Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-23T22:02:51.357810Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZHc5vRtc8tGfcncZkWVrLq"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:52 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZHc5vRtc8tGfcncZkWVrLq
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BAy4HFUqJWDxaCtUKAeUWpL"},"created_at":"2014-07-23T22:02:51.040423Z","attempts_remaining":3,"updated_at":"2014-07-23T22:02:51.357810Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZHc5vRtc8tGfcncZkWVrLq","amount_1":1,"amount_2":1}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:52 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM17ecf9fe12b511e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '598'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BAy4HFUqJWDxaCtUKAeUWpL"
              },
              "href": "/verifications/BZHc5vRtc8tGfcncZkWVrLq",
              "created_at": "2014-07-23T22:02:51.040423Z",
              "attempts_remaining": 2,
              "updated_at": "2014-07-23T22:02:52.832977Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZHc5vRtc8tGfcncZkWVrLq"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:52 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:53 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM183178fe12b511e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '522'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZHc5vRtc8tGfcncZkWVrLq"
              },
              "can_credit": true,
              "created_at": "2014-07-23T22:02:42.938465Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-23T22:02:52.830981Z",
              "href": "/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BAy4HFUqJWDxaCtUKAeUWpL"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:53 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BAy4HFUqJWDxaCtUKAeUWpL/debits
    body:
      encoding: UTF-8
      string: '{"amount":62500,"appears_on_statement_as":"Epicodus Tuition","description":"Some
        descriptive text for the debit in the dashboard"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Wed, 23 Jul 2014 22:02:53 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM186e2eb612b511e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.91
      Content-Length:
      - '1030'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": "Some descriptive text for the debit in the dashboard",
              "links": {
                "customer": null,
                "source": "BAy4HFUqJWDxaCtUKAeUWpL",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-07-23T22:02:53.909804Z",
              "created_at": "2014-07-23T22:02:53.655647Z",
              "transaction_number": "W088-248-5942",
              "failure_reason": null,
              "currency": "USD",
              "amount": 62500,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WDK8yBvncMwCpHl7hNhxC7D",
              "appears_on_statement_as": "BAL*Epicodus Tuition",
              "id": "WDK8yBvncMwCpHl7hNhxC7D"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.order": "/orders/{debits.order}",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.events": "/debits/{debits.id}/events"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Jul 2014 22:02:54 GMT
recorded_with: VCR 2.9.2
